In [27]:
import pandas as pd

In [28]:
# Inserindo os dados em um dict
dados_dict = { "Estado": ['SP', 'RJ', 'MG', 'ES', 'Outros'],
              "Faturamento": [67836.43, 36678.66, 29229.88, 27165.48, 19849.53]
             }

In [29]:
# Carregando e vendo os dados
dados = pd.DataFrame.from_dict(dados_dict)
dados.head()

   Estado  Faturamento
0      SP     67836.43
1      RJ     36678.66
2      MG     29229.88
3      ES     27165.48
4  Outros     19849.53

In [30]:
# Cálculo do faturamento total
faturamento_total = sum(dados['Faturamento'])
faturamento_total

180759.98

In [31]:
# Criação de nova coluna, contendo os percentuais, com duas casas decimais
dados['Porcentagem'] = round(dados['Faturamento']*100/faturamento_total, 2)
dados.head()

   Estado  Faturamento  Porcentagem
0      SP     67836.43        37.53
1      RJ     36678.66        20.29
2      MG     29229.88        16.17
3      ES     27165.48        15.03
4  Outros     19849.53        10.98